## Terraform Summary

| Step                         | Result  |
|:-----------------------------|:-------:|
| 🖌  Terraform Format & Style | ✅ |
| ⚙️  Terraform Initialization  | ✅ |
| 🤖  Terraform Validation     | ✅ |
| 📖  Terraform Plan           | ✅ |

_**Hint:** If "Terraform Format & Style" failed, run `terraform fmt -recursive` from the `terraform/` directory and commit the results._

### Output

<details>
<summary>Validation Output</summary>

```
Success! The configuration is valid.


```

</details>

<details>
<summary>Plan Output</summary>

```diff

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+   create
  ~ update in-place
-   destroy
-/+ destroy and then create replacement
+/- create replacement and then destroy

Terraform will perform the following actions:

  # aws_ecs_service.console will be updated in-place
  ~ resource "aws_ecs_service" "console" {
        id                                 = "arn:aws:ecs:us-west-2:357150818708:service/cpfreporter/cpfreporter-console"
        name                               = "cpfreporter-console"
        tags                               = {}
      ~ task_definition                    = "arn:aws:ecs:us-west-2:357150818708:task-definition/cpfreporter-console:118" -> (known after apply)
        # (15 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # aws_ecs_task_definition.console must be replaced
+/- resource "aws_ecs_task_definition" "console" {
      ~ arn                      = "arn:aws:ecs:us-west-2:357150818708:task-definition/cpfreporter-console:118" -> (known after apply)
      ~ arn_without_revision     = "arn:aws:ecs:us-west-2:357150818708:task-definition/cpfreporter-console" -> (known after apply)
      ~ container_definitions    = jsonencode(
          ~ [
              ~ {
                  ~ image                  = "ghcr.io/usdigitalresponse/cpf-reporter-console@sha256:12927d2ca12781d41e4be4aaf2223fa8b5cd7a94d5629669d8b5e3da253e2faf" -> "ghcr.io/usdigitalresponse/cpf-reporter-console@sha256:ac299b7f5536a84b1d076549108cc2d7831e95e8b85d58c401ccb859004059a8"
-                   mountPoints            = []
                    name                   = "console"
-                   portMappings           = []
-                   systemControls         = []
-                   volumesFrom            = []
                    # (7 unchanged attributes hidden)
                },
            ] # forces replacement
        )
      ~ id                       = "cpfreporter-console" -> (known after apply)
      ~ revision                 = 118 -> (known after apply)
-       tags                     = {} -> null
        # (10 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # aws_s3_object.lambda_artifact-graphql must be replaced
+/- resource "aws_s3_object" "lambda_artifact-graphql" {
+       acl                    = (known after apply)
      ~ arn                    = "arn:aws:s3:::cpfreporter-lambdaartifacts-357150818708-us-west-2/graphql.744634c3f1dc482a7d2f0daa8bb0c7fb.zip" -> (known after apply)
      ~ bucket_key_enabled     = false -> (known after apply)
+       checksum_crc32         = (known after apply)
+       checksum_crc32c        = (known after apply)
+       checksum_sha1          = (known after apply)
+       checksum_sha256        = (known after apply)
      ~ content_type           = "binary/octet-stream" -> (known after apply)
      ~ etag                   = "a35f8e5d9898bb15a872dbfa891beeb5-6" -> "9aec4e89c018919741d557f4baa1d761"
      ~ id                     = "graphql.744634c3f1dc482a7d2f0daa8bb0c7fb.zip" -> (known after apply)
      ~ key                    = "graphql.744634c3f1dc482a7d2f0daa8bb0c7fb.zip" -> "graphql.9aec4e89c018919741d557f4baa1d761.zip" # forces replacement
+       kms_key_id             = (known after apply)
-       metadata               = {} -> null
      ~ source_hash            = "744634c3f1dc482a7d2f0daa8bb0c7fb" -> "9aec4e89c018919741d557f4baa1d761"
      ~ storage_class          = "STANDARD" -> (known after apply)
-       tags                   = {} -> null
      ~ version_id             = "34krufQvbVvcTxRyCipaVusLdcvhkkfP" -> (known after apply)
        # (5 unchanged attributes hidden)
    }

  # aws_s3_object.lambda_artifact-processValidationJson will be updated in-place
  ~ resource "aws_s3_object" "lambda_artifact-processValidationJson" {
      ~ etag                   = "ada4a30aba929324eb23ead6dd3883bf-5" -> "49f6291dc84bb27b95f10c7de8148425"
        id                     = "processValidationJson.49f6291dc84bb27b95f10c7de8148425.zip"
        tags                   = {}
      ~ version_id             = "mxTS7O8opRAM167qmVYapwlvElFCH02L" -> (known after apply)
        # (12 unchanged attributes hidden)
    }

  # aws_s3_object.lambda_artifact-python must be replaced
-/+ resource "aws_s3_object" "lambda_artifact-python" {
+       acl                    = (known after apply)
      ~ arn                    = "arn:aws:s3:::cpfreporter-lambdaartifacts-357150818708-us-west-2/python.2aaa8bb97b09dbc549d408432cd63deb.zip" -> (known after apply)
      ~ bucket_key_enabled     = false -> (known after apply)
+       checksum_crc32         = (known after apply)
+       checksum_crc32c        = (known after apply)
+       checksum_sha1          = (known after apply)
+       checksum_sha256        = (known after apply)
      ~ content_type           = "binary/octet-stream" -> (known after apply)
      ~ etag                   = "3fb005bc6c14836d71783e2930afee30-4" -> "c708f361254ea3272b6b76dbbcd4b63c"
      ~ id                     = "python.2aaa8bb97b09dbc549d408432cd63deb.zip" -> (known after apply)
      ~ key                    = "python.2aaa8bb97b09dbc549d408432cd63deb.zip" -> "python.c708f361254ea3272b6b76dbbcd4b63c.zip" # forces replacement
+       kms_key_id             = (known after apply)
-       metadata               = {} -> null
      ~ source_hash            = "2aaa8bb97b09dbc549d408432cd63deb" -> "c708f361254ea3272b6b76dbbcd4b63c"
      ~ storage_class          = "STANDARD" -> (known after apply)
-       tags                   = {} -> null
      ~ version_id             = "VNqTFyZpp1BicBmAWET05059aJxP.Kqw" -> (known after apply)
        # (5 unchanged attributes hidden)
    }

  # aws_s3_object.origin_dist_artifact["200.html"] will be updated in-place
  ~ resource "aws_s3_object" "origin_dist_artifact" {
      ~ etag                   = "efe5b50f888c56a1f180bac40a9567d3" -> "81d5cc6cfe2b776f1f7badadd8c99ef8"
        id                     = "dist/200.html"
      ~ source_hash            = "efe5b50f888c56a1f180bac40a9567d3" -> "81d5cc6cfe2b776f1f7badadd8c99ef8"
        tags                   = {}
      ~ version_id             = "dFkMHKn4p0KU1.v0bX0E.W.nlT_VHE_B" -> (known after apply)
        # (11 unchanged attributes hidden)
    }

  # aws_s3_object.origin_dist_artifact["build-manifest.json"] will be updated in-place
  ~ resource "aws_s3_object" "origin_dist_artifact" {
      ~ etag                   = "2c63d91271e0488e3545ef6f80bb64b1" -> "74ea080761e66561b33efaeca653a23a"
        id                     = "dist/build-manifest.json"
      ~ source_hash            = "2c63d91271e0488e3545ef6f80bb64b1" -> "74ea080761e66561b33efaeca653a23a"
        tags                   = {}
      ~ version_id             = "2LPbJEmyGv1T91MqIOkzxY7328FjVBvF" -> (known after apply)
        # (11 unchanged attributes hidden)
    }

  # aws_s3_object.origin_dist_artifact["chunk-references.json"] will be updated in-place
  ~ resource "aws_s3_object" "origin_dist_artifact" {
      ~ etag                   = "da9d57942cece4dce684b1d7c79229c5" -> "9be261ba1fd32a272a3e048079164d7f"
        id                     = "dist/chunk-references.json"
      ~ source_hash            = "da9d57942cece4dce684b1d7c79229c5" -> "9be261ba1fd32a272a3e048079164d7f"
        tags                   = {}
      ~ version_id             = "rsxRp3Ey7X8RfrEMj3QzfkgXdcDDZRpP" -> (known after apply)
        # (11 unchanged attributes hidden)
    }

  # aws_s3_object.origin_dist_artifact["index.html"] will be updated in-place
  ~ resource "aws_s3_object" "origin_dist_artifact" {
      ~ etag                   = "efe5b50f888c56a1f180bac40a9567d3" -> "81d5cc6cfe2b776f1f7badadd8c99ef8"
        id                     = "dist/index.html"
      ~ source_hash            = "efe5b50f888c56a1f180bac40a9567d3" -> "81d5cc6cfe2b776f1f7badadd8c99ef8"
        tags                   = {}
      ~ version_id             = "JdQHyAPlXgJ1_EfIDentoqL5m7_UKmq_" -> (known after apply)
        # (11 unchanged attributes hidden)
    }

  # aws_s3_object.origin_dist_artifact["static/js/AgencyAgenciesPage.05680633.chunk.js"] will be destroyed
  # (because key ["static/js/AgencyAgenciesPage.05680633.chunk.js"] is not in for_each map)
-   resource "aws_s3_object" "origin_dist_artifact" {
-       arn                    = "arn:aws:s3:::cpfreporter-origin-357150818708-us-west-2/dist/static/js/AgencyAgenciesPage.05680633.chunk.js" -> null
-       bucket                 = "cpfreporter-origin-357150818708-us-west-2" -> null
-       bucket_key_enabled     = false -> null
-       content_type           = "text/javascript" -> null
-       etag                   = "8506f5ef6b945793acf7c69eadba224d" -> null
-       force_destroy          = false -> null
-       id                     = "dist/static/js/AgencyAgenciesPage.05680633.chunk.js" -> null
-       key                    = "dist/static/js/AgencyAgenciesPage.05680633.chunk.js" -> null
-       metadata               = {} -> null
-       server_side_encryption = "AES256" -> null
-       source                 = "/home/runner/work/cpf-reporter/cpf-reporter/web/dist/static/js/AgencyAgenciesPage.05680633.chunk.js" -> null
-       source_hash            = "8506f5ef6b945793acf7c69eadba224d" -> null
-       storage_class          = "STANDARD" -> null
-       tags                   = {} -> null
-       tags_all               = {
-           "env"        = "staging"
-           "management" = "terraform"
-           "owner"      = "grants"
-           "repo"       = "cpf-reporter"
-           "service"    = "cpf-reporter"
-           "usage"      = "workload"
        } -> null
-       version_id             = "ouYyL0U.nTbyq29zZoa5y82Rlh3691aD" -> null
    }

  # aws_s3_object.origin_dist_artifact["static/js/AgencyAgenciesPage.05680633.chunk.js.LICENSE.txt"] will be destroyed
  # (because key ["static/js/AgencyAgenciesPage.05680633.chunk.js.LICENSE.txt"] is not in for_each map)
-   resource "aws_s3_object" "origin_dist_artifact" {
-       arn                    = "arn:aws:s3:::cpfreporter-origin-357150818708-us-west-2/dist/static/js/AgencyAgenciesPage.05680633.chunk.js.LICENSE.txt" -> null
-       bucket                 = "cpfreporter-origin-357150818708-us-west-2" -> null
-       bucket_key_enabled     = false -> null
-       content_type           = "text/plain" -> null
-       etag                   = "55d3003fc652eef3fccd962d62d4f328" -> null
-       force_destroy          = false -> null
-       id                     = "dist/static/js/AgencyAgenciesPage.05680633.chunk.js.LICENSE.txt" -> null
-       key                    = "dist/static/js/AgencyAgenciesPage.05680633.chunk.js.LICENSE.txt" -> null
-       metadata               = {} -> null
-       server_side_encryption = "AES256" -> null
-       source                 = "/home/runner/work/cpf-reporter/cpf-reporter/web/dist/static/js/AgencyAgenciesPage.05680633.chunk.js.LICENSE.txt" -> null
-       source_hash            = "55d3003fc652eef3fccd962d62d4f328" -> null
-       storage_class          = "STANDARD" -> null
-       tags                   = {} -> null
-       tags_all               = {
-           "env"        = "staging"
-           "management" = "terraform"
-           "owner"      = "grants"
-           "repo"       = "cpf-reporter"
-           "service"    = "cpf-reporter"
-           "usage"      = "workload"
        } -> null
-       version_id             = "iUtWOFzHVYwEYis0EDWWwqLSfjjEXOtU" -> null
    }

  # aws_s3_object.origin_dist_artifact["static/js/AgencyAgenciesPage.2c6555fe.chunk.js"] will be created
+   resource "aws_s3_object" "origin_dist_artifact" {
+       acl                    = (known after apply)
+       arn                    = (known after apply)
+       bucket                 = "cpfreporter-origin-357150818708-us-west-2"
+       bucket_key_enabled     = (known after apply)
+       checksum_crc32         = (known after apply)
+       checksum_crc32c        = (known after apply)
+       checksum_sha1          = (known after apply)
+       checksum_sha256        = (known after apply)
+       content_type           = "text/javascript"
+       etag                   = "9164a18e995519620d4df182f3648c27"
+       force_destroy          = false
+       id                     = (known after apply)
+       key                    = "dist/static/js/AgencyAgenciesPage.2c6555fe.chunk.js"
+       kms_key_id             = (known after apply)
+       server_side_encryption = "AES256"
+       source                 = "/home/runner/work/cpf-reporter/cpf-reporter/web/dist/static/js/AgencyAgenciesPage.2c6555fe.chunk.js"
+       source_hash            = "9164a18e995519620d4df182f3648c27"
+       storage_class          = (known after apply)
+       tags_all               = {
+           "env"        = "staging"
+           "management" = "terraform"
+           "owner"      = "grants"
+           "repo"       = "cpf-reporter"
+           "service"    = "cpf-reporter"
+           "usage"      = "workload"
        }
+       version_id             = (known after apply)
    }

  # aws_s3_object.origin_dist_artifact["static/js/AgencyAgenciesPage.2c6555fe.chunk.js.LICENSE.txt"] will be created
+   resource "aws_s3_object" "origin_dist_artifact" {
+       acl                    = (known after apply)
+       arn                    = (known after apply)
+       bucket                 = "cpfreporter-origin-357150818708-us-west-2"
+       bucket_key_enabled     = (known after apply)
+       checksum_crc32         = (known after apply)
+       checksum_crc32c        = (known after apply)
+       checksum_sha1          = (known after apply)
+       checksum_sha256        = (known after apply)
+       content_type           = "text/plain"
+       etag                   = "55d3003fc652eef3fccd962d62d4f328"
+       force_destroy          = false
+       id                     = (known after apply)
+       key                    = "dist/static/js/AgencyAgenciesPage.2c6555fe.chunk.js.LICENSE.txt"
+       kms_key_id             = (known after apply)
+       server_side_encryption = "AES256"
+       source                 = "/home/runner/work/cpf-reporter/cpf-reporter/web/dist/static/js/AgencyAgenciesPage.2c6555fe.chunk.js.LICENSE.txt"
+       source_hash            = "55d3003fc652eef3fccd962d62d4f328"
+       storage_class          = (known after apply)
+       tags_all               = {
+           "env"        = "staging"
+           "management" = "terraform"
+           "owner"      = "grants"
+           "repo"       = "cpf-reporter"
+           "service"    = "cpf-reporter"
+           "usage"      = "workload"
        }
+       version_id             = (known after apply)
    }

  # aws_s3_object.origin_dist_artifact["static/js/AgencyEditAgencyPage.42b39dda.chunk.js"] will be destroyed
  # (because key ["static/js/AgencyEditAgencyPage.42b39dda.chunk.js"] is not in for_each map)
-   resource "aws_s3_object" "origin_dist_artifact" {
-       arn                    = "arn:aws:s3:::cpfreporter-origin-357150818708-us-west-2/dist/static/js/AgencyEditAgencyPage.42b39dda.chunk.js" -> null
-       bucket                 = "cpfreporter-origin-357150818708-us-west-2" -> null
-       bucket_key_enabled     = false -> null
-       content_type           = "text/javascript" -> null
-       etag                   = "9435f5722e6011d14ea337c693691a37" -> null
-       force_destroy          = false -> null
-       id                     = "dist/static/js/AgencyEditAgencyPage.42b39dda.chunk.js" -> null
-       key                    = "dist/static/js/AgencyEditAgencyPage.42b39dda.chunk.js" -> null
-       metadata               = {} -> null
-       server_side_encryption = "AES256" -> null
-       source                 = "/home/runner/work/cpf-reporter/cpf-reporter/web/dist/static/js/AgencyEditAgencyPage.42b39dda.chunk.js" -> null
-       source_hash            = "9435f5722e6011d14ea337c693691a37" -> null
-       storage_class          = "STANDARD" -> null
-       tags                   = {} -> null
-       tags_all               = {
-           "env"        = "staging"
-           "management" = "terraform"
-           "owner"      = "grants"
-           "repo"       = "cpf-reporter"
-           "service"    = "cpf-reporter"
-           "usage"      = "workload"
        } -> null
-       version_id             = "nTrrpTr2aJekyzDNJgBKKBQNkLVY_OZH" -> null
    }

  # aws_s3_object.origin_dist_artifact["static/js/AgencyEditAgencyPage.42b39dda.chunk.js.LICENSE.txt"] will be destroyed
  # (because key ["static/js/AgencyEditAgencyPage.42b39dda.chunk.js.LICENSE.txt"] is not in for_each map)
-   resource "aws_s3_object" "origin_dist_artifact" {
-       arn                    = "arn:aws:s3:::cpfreporter-origin-357150818708-us-west-2/dist/static/js/AgencyEditAgencyPage.42b39dda.chunk.js.LICENSE.txt" -> null
-       bucket                 = "cpfreporter-origin-357150818708-us-west-2" -> null
-       bucket_key_enabled     = false -> null
-       content_type           = "text/plain" -> null
-       etag                   = "4e11d0eec7753fcebe4544ba4612e69d" -> null
-       force_destroy          = false -> null
-       id                     = "dist/static/js/AgencyEditAgencyPage.42b39dda.chunk.js.LICENSE.txt" -> null
-       key                    = "dist/static/js/AgencyEditAgencyPage.42b39dda.chunk.js.LICENSE.txt" -> null
-       metadata               = {} -> null
-       server_side_encryption = "AES256" -> null
-       source                 = "/home/runner/work/cpf-reporter/cpf-reporter/web/dist/static/js/AgencyEditAgencyPage.42b39dda.chunk.js.LICENSE.txt" -> null
-       source_hash            = "4e11d0eec7753fcebe4544ba4612e69d" -> null
-       storage_class          = "STANDARD" -> null
-       tags                   = {} -> null
-       tags_all               = {
-           "env"        = "staging"
-           "management" = "terraform"
-           "owner"      = "grants"
-           "repo"       = "cpf-reporter"
-           "service"    = "cpf-reporter"
-           "usage"      = "workload"
        } -> null
-       version_id             = "A8YMCOKTAPhhC0mfC9yBU6kJKmG7kgER" -> null
    }

  # aws_s3_object.origin_dist_artifact["static/js/AgencyEditAgencyPage.8255b6cd.chunk.js"] will be created
+   resource "aws_s3_object" "origin_dist_artifact" {
+       acl                    = (known after apply)
+       arn                    = (known after apply)
+       bucket                 = "cpfreporter-origin-357150818708-us-west-2"
+       bucket_key_enabled     = (known after apply)
+       checksum_crc32         = (known after apply)
+       checksum_crc32c        = (known after apply)
+       checksum_sha1          = (known after apply)
+       checksum_sha256        = (known after apply)
+       content_type           = "text/javascript"
+       etag                   = "d74ecfcb47b97ef06d2de4f65fb60621"
+       force_destroy          = false
+       id                     = (known after apply)
+       key                    = "dist/static/js/AgencyEditAgencyPage.8255b6cd.chunk.js"
+       kms_key_id             = (known after apply)
+       server_side_encryption = "AES256"
+       source                 = "/home/runner/work/cpf-reporter/cpf-reporter/web/dist/static/js/AgencyEditAgencyPage.8255b6cd.chunk.js"
+       source_hash            = "d74ecfcb47b97ef06d2de4f65fb60621"
+       storage_class          = (known after apply)
+       tags_all               = {
+           "env"        = "staging"
+           "management" = "terraform"
+           "owner"      = "grants"
+           "repo"       = "cpf-reporter"
+           "service"    = "cpf-reporter"
+           "usage"      = "workload"
        }
+       version_id             = (known after apply)
    }

  # aws_s3_object.origin_dist_artifact["static/js/AgencyEditAgencyPage.8255b6cd.chunk.js.LICENSE.txt"] will be created
+   resource "aws_s3_object" "origin_dist_artifact" {
+       acl                    = (known after apply)
+       arn                    = (known after apply)
+       bucket                 = "cpfreporter-origin-357150818708-us-west-2"
+       bucket_key_enabled     = (known after apply)
+       checksum_crc32         = (known after apply)
+       checksum_crc32c        = (known after apply)
+       checksum_sha1          = (known after apply)
+       checksum_sha256        = (known after apply)
+       content_type           = "text/plain"
+       etag                   = "4e11d0eec7753fcebe4544ba4612e69d"
+       force_destroy          = false
+       id                     = (known after apply)
+       key                    = "dist/static/js/AgencyEditAgencyPage.8255b6cd.chunk.js.LICENSE.txt"
+       kms_key_id             = (known after apply)
+       server_side_encryption = "AES256"
+       source                 = "/home/runner/work/cpf-reporter/cpf-reporter/web/dist/static/js/AgencyEditAgencyPage.8255b6cd.chunk.js.LICENSE.txt"
+       source_hash            = "4e11d0eec7753fcebe4544ba4612e69d"
+       storage_class          = (known after apply)
+       tags_all               = {
+           "env"        = "staging"
+           "management" = "terraform"
+           "owner"      = "grants"
+           "repo"       = "cpf-reporter"
+           "service"    = "cpf-reporter"
+           "usage"      = "workload"
        }
+       version_id             = (known after apply)
    }

  # aws_s3_object.origin_dist_artifact["static/js/AgencyNewAgencyPage.05d52eb2.chunk.js"] will be created
+   resource "aws_s3_object" "origin_dist_artifact" {
+       acl                    = (known after apply)
+       arn                    = (known after apply)
+       bucket                 = "cpfreporter-origin-357150818708-us-west-2"
+       bucket_key_enabled     = (known after apply)
+       checksum_crc32         = (known after apply)
+       checksum_crc32c        = (known after apply)
+       checksum_sha1          = (known after apply)
+       checksum_sha256        = (known after apply)
+       content_type           = "text/javascript"
+       etag                   = "8e1c9cd8ab04a56801467a6c4926f0e1"
+       force_destroy          = false
+       id                     = (known after apply)
+       key                    = "dist/static/js/AgencyNewAgencyPage.05d52eb2.chunk.js"
+       kms_key_id             = (known after apply)
+       server_side_encryption = "AES256"
+       source                 = "/home/runner/work/cpf-reporter/cpf-reporter/web/dist/static/js/AgencyNewAgencyPage.05d52eb2.chunk.js"
+       source_hash            = "8e1c9cd8ab04a56801467a6c4926f0e1"
+       storage_class          = (known after apply)
+       tags_all               = {
+           "env"        = "staging"
+           "management" = "terraform"
+           "owner"      = "grants"
+           "repo"       = "cpf-reporter"
+           "service"    = "cpf-reporter"
+           "usage"      = "workload"
        }
+       version_id             = (known after apply)
    }

  # aws_s3_object.origin_dist_artifact["static/js/AgencyNewAgencyPage.05d52eb2.chunk.js.LICENSE.txt"] will be created
+   resource "aws_s3_object" "origin_dist_artifact" {
+       acl                    = (known after apply)
+       arn                    = (known after apply)
+       bucket                 = "cpfreporter-origin-357150818708-us-west-2"
+       bucket_key_enabled     = (known after apply)
+       checksum_crc32         = (known after apply)
+       checksum_crc32c        = (known after apply)
+       checksum_sha1          = (known after apply)
+       checksum_sha256        = (known after apply)
+       content_type           = "text/plain"
+       etag                   = "16eb506bb04b8649c6a08c630eab671b"
+       force_destroy          = false
+       id                     = (known after apply)
+       key                    = "dist/static/js/AgencyNewAgencyPage.05d52eb2.chunk.js.LICENSE.txt"
+       kms_key_id             = (known after apply)
+       server_side_encryption = "AES256"
+       source                 = "/home/runner/work/cpf-reporter/cpf-reporter/web/dist/static/js/AgencyNewAgencyPage.05d52eb2.chunk.js.LICENSE.txt"
+       source_hash            = "16eb506bb04b8649c6a08c630eab671b"
+       storage_class          = (known after apply)
+       tags_all               = {
+           "env"        = "staging"
+           "management" = "terraform"
+           "owner"      = "grants"
+           "repo"       = "cpf-reporter"
+           "service"    = "cpf-reporter"
+           "usage"      = "workload"
        }
+       version_id             = (known after apply)
    }

  # aws_s3_object.origin_dist_artifact["static/js/AgencyNewAgencyPage.1659dfbb.chunk.js"] will be destroyed
  # (because key ["static/js/AgencyNewAgencyPage.1659dfbb.chunk.js"] is not in for_each map)
-   resource "aws_s3_object" "origin_dist_artifact" {
-       arn                    = "arn:aws:s3:::cpfreporter-origin-357150818708-us-west-2/dist/static/js/AgencyNewAgencyPage.1659dfbb.chunk.js" -> null
-       bucket                 = "cpfreporter-origin-357150818708-us-west-2" -> null
-       bucket_key_enabled     = false -> null
-       content_type           = "text/javascript" -> null
-       etag                   = "54c22ffe3b13e92a7fc46e8f653db6a2" -> null
-       force_destroy          = false -> null
-       id                     = "dist/static/js/AgencyNewAgencyPage.1659dfbb.chunk.js" -> null
-       key                    = "dist/static/js/AgencyNewAgencyPage.1659dfbb.chunk.js" -> null
-       metadata               = {} -> null
-       server_side_encryption = "AES256" -> null
-       source                 = "/home/runner/work/cpf-reporter/cpf-reporter/web/dist/static/js/AgencyNewAgencyPage.1659dfbb.chunk.js" -> null
-       source_hash            = "54c22ffe3b13e92a7fc46e8f653db6a2" -> null
-       storage_class          = "STANDARD" -> null
-       tags                   = {} -> null
-       tags_all               = {
-           "env"        = "staging"
-           "management" = "terraform"
-           "owner"      = "grants"
-           "repo"       = "cpf-reporter"
-           "service"    = "cpf-reporter"
-           "usage"      = "workload"
        } -> null
-       version_id             = "0Nzf5Zy5UgnDX0_nSJPTP6vnbDn81H7u" -> null
    }

  # aws_s3_object.origin_dist_artifact["static/js/AgencyNewAgencyPage.1659dfbb.chunk.js.LICENSE.txt"] will be destroyed
  # (because key ["static/js/AgencyNewAgencyPage.1659dfbb.chunk.js.LICENSE.txt"] is not in for_each map)
-   resource "aws_s3_object" "origin_dist_artifact" {
-       arn                    = "arn:aws:s3:::cpfreporter-origin-357150818708-us-west-2/dist/static/js/AgencyNewAgencyPage.1659dfbb.chunk.js.LICENSE.txt" -> null
-       bucket                 = "cpfreporter-origin-357150818708-us-west-2" -> null
-       bucket_key_enabled     = false -> null
-       content_type           = "text/plain" -> null
-       etag                   = "16eb506bb04b8649c6a08c630eab671b" -> null
-       force_destroy          = false -> null
-       id                     = "dist/static/js/AgencyNewAgencyPage.1659dfbb.chunk.js.LICENSE.txt" -> null
-       key                    = "dist/static/js/AgencyNewAgencyPage.1659dfbb.chunk.js.LICENSE.txt" -> null
-       metadata               = {} -> null
-       server_side_encryption = "AES256" -> null
-       source                 = "/home/runner/work/cpf-reporter/cpf-reporter/web/dist/static/js/AgencyNewAgencyPage.1659dfbb.chunk.js.LICENSE.txt" -> null
-       source_hash            = "16eb506bb04b8649c6a08c630eab671b" -> null
-       storage_class          = "STANDARD" -> null
-       tags                   = {} -> null
-       tags_all               = {
-           "env"        = "staging"
-           "management" = "terraform"
-           "owner"      = "grants"
-           "repo"       = "cpf-reporter"
-           "service"    = "cpf-reporter"
-           "usage"      = "workload"
        } -> null
-       version_id             = "eYaZHT4HvW5tBbneiERmeOoZ41gTPaSO" -> null
    }

  # aws_s3_object.origin_dist_artifact["static/js/LoginPage.a7e97a69.chunk.js"] will be destroyed
  # (because key ["static/js/LoginPage.a7e97a69.chunk.js"] is not in for_each map)
-   resource "aws_s3_object" "origin_dist_artifact" {
-       arn                    = "arn:aws:s3:::cpfreporter-origin-357150818708-us-west-2/dist/static/js/LoginPage.a7e97a69.chunk.js" -> null
-       bucket                 = "cpfreporter-origin-357150818708-us-west-2" -> null
-       bucket_key_enabled     = false -> null
-       content_type           = "text/javascript" -> null
-       etag                   = "01530c51a535f3005fb80e8c706ee9de" -> null
-       force_destroy          = false -> null
-       id                     = "dist/static/js/LoginPage.a7e97a69.chunk.js" -> null
-       key                    = "dist/static/js/LoginPage.a7e97a69.chunk.js" -> null
-       metadata               = {} -> null
-       server_side_encryption = "AES256" -> null
-       source                 = "/home/runner/work/cpf-reporter/cpf-reporter/web/dist/static/js/LoginPage.a7e97a69.chunk.js" -> null
-       source_hash            = "01530c51a535f3005fb80e8c706ee9de" -> null
-       storage_class          = "STANDARD" -> null
-       tags                   = {} -> null
-       tags_all               = {
-           "env"        = "staging"
-           "management" = "terraform"
-           "owner"      = "grants"
-           "repo"       = "cpf-reporter"
-           "service"    = "cpf-reporter"
-           "usage"      = "workload"
        } -> null
-       version_id             = "CPbIpLypPvXJ6VrLy9PUbjX_EiqEvbUY" -> null
    }

  # aws_s3_object.origin_dist_artifact["static/js/LoginPage.a7e97a69.chunk.js.LICENSE.txt"] will be destroyed
  # (because key ["static/js/LoginPage.a7e97a69.chunk.js.LICENSE.txt"] is not in for_each map)
-   resource "aws_s3_object" "origin_dist_artifact" {
-       arn                    = "arn:aws:s3:::cpfreporter-origin-357150818708-us-west-2/dist/static/js/LoginPage.a7e97a69.chunk.js.LICENSE.txt" -> null
-       bucket                 = "cpfreporter-origin-357150818708-us-west-2" -> null
-       bucket_key_enabled     = false -> null
-       content_type           = "text/plain" -> null
-       etag                   = "f7acc4b4f3496e2aa6c4d47261fcb01c" -> null
-       force_destroy          = false -> null
-       id                     = "dist/static/js/LoginPage.a7e97a69.chunk.js.LICENSE.txt" -> null
-       key                    = "dist/static/js/LoginPage.a7e97a69.chunk.js.LICENSE.txt" -> null
-       metadata               = {} -> null
-       server_side_encryption = "AES256" -> null
-       source                 = "/home/runner/work/cpf-reporter/cpf-reporter/web/dist/static/js/LoginPage.a7e97a69.chunk.js.LICENSE.txt" -> null
-       source_hash            = "f7acc4b4f3496e2aa6c4d47261fcb01c" -> null
-       storage_class          = "STANDARD" -> null
-       tags                   = {} -> null
-       tags_all               = {
-           "env"        = "staging"
-           "management" = "terraform"
-           "owner"      = "grants"
-           "repo"       = "cpf-reporter"
-           "service"    = "cpf-reporter"
-           "usage"      = "workload"
        } -> null
-       version_id             = "khoUJ.d_texFXV2gU.XJUqOPHBCJlkUT" -> null
    }

  # aws_s3_object.origin_dist_artifact["static/js/LoginPage.e1b4fd1b.chunk.js"] will be created
+   resource "aws_s3_object" "origin_dist_artifact" {
+       acl                    = (known after apply)
+       arn                    = (known after apply)
+       bucket                 = "cpfreporter-origin-357150818708-us-west-2"
+       bucket_key_enabled     = (known after apply)
+       checksum_crc32         = (known after apply)
+       checksum_crc32c        = (known after apply)
+       checksum_sha1          = (known after apply)
+       checksum_sha256        = (known after apply)
+       content_type           = "text/javascript"
+       etag                   = "06e7a06ecea92c2461607042e8f4b3bf"
+       force_destroy          = false
+       id                     = (known after apply)
+       key                    = "dist/static/js/LoginPage.e1b4fd1b.chunk.js"
+       kms_key_id             = (known after apply)
+       server_side_encryption = "AES256"
+       source                 = "/home/runner/work/cpf-reporter/cpf-reporter/web/dist/static/js/LoginPage.e1b4fd1b.chunk.js"
+       source_hash            = "06e7a06ecea92c2461607042e8f4b3bf"
+       storage_class          = (known after apply)
+       tags_all               = {
+           "env"        = "staging"
+           "management" = "terraform"
+           "owner"      = "grants"
+           "repo"       = "cpf-reporter"
+           "service"    = "cpf-reporter"
+           "usage"      = "workload"
        }
+       version_id             = (known after apply)
    }

  # aws_s3_object.origin_dist_artifact["static/js/LoginPage.e1b4fd1b.chunk.js.LICENSE.txt"] will be created
+   resource "aws_s3_object" "origin_dist_artifact" {
+       acl                    = (known after apply)
+       arn                    = (known after apply)
+       bucket                 = "cpfreporter-origin-357150818708-us-west-2"
+       bucket_key_enabled     = (known after apply)
+       checksum_crc32         = (known after apply)
+       checksum_crc32c        = (known after apply)
+       checksum_sha1          = (known after apply)
+       checksum_sha256        = (known after apply)
+       content_type           = "text/plain"
+       etag                   = "f7acc4b4f3496e2aa6c4d47261fcb01c"
+       force_destroy          = false
+       id                     = (known after apply)
+       key                    = "dist/static/js/LoginPage.e1b4fd1b.chunk.js.LICENSE.txt"
+       kms_key_id             = (known after apply)
+       server_side_encryption = "AES256"
+       source                 = "/home/runner/work/cpf-reporter/cpf-reporter/web/dist/static/js/LoginPage.e1b4fd1b.chunk.js.LICENSE.txt"
+       source_hash            = "f7acc4b4f3496e2aa6c4d47261fcb01c"
+       storage_class          = (known after apply)
+       tags_all               = {
+           "env"        = "staging"
+           "management" = "terraform"
+           "owner"      = "grants"
+           "repo"       = "cpf-reporter"
+           "service"    = "cpf-reporter"
+           "usage"      = "workload"
        }
+       version_id             = (known after apply)
    }

  # aws_s3_object.origin_dist_artifact["static/js/UploadNewUploadPage.005e6f67.chunk.js"] will be destroyed
  # (because key ["static/js/UploadNewUploadPage.005e6f67.chunk.js"] is not in for_each map)
-   resource "aws_s3_object" "origin_dist_artifact" {
-       arn                    = "arn:aws:s3:::cpfreporter-origin-357150818708-us-west-2/dist/static/js/UploadNewUploadPage.005e6f67.chunk.js" -> null
-       bucket                 = "cpfreporter-origin-357150818708-us-west-2" -> null
-       bucket_key_enabled     = false -> null
-       content_type           = "text/javascript" -> null
-       etag                   = "5a7f070f4366db81f210a54ef9e2459a" -> null
-       force_destroy          = false -> null
-       id                     = "dist/static/js/UploadNewUploadPage.005e6f67.chunk.js" -> null
-       key                    = "dist/static/js/UploadNewUploadPage.005e6f67.chunk.js" -> null
-       metadata               = {} -> null
-       server_side_encryption = "AES256" -> null
-       source                 = "/home/runner/work/cpf-reporter/cpf-reporter/web/dist/static/js/UploadNewUploadPage.005e6f67.chunk.js" -> null
-       source_hash            = "5a7f070f4366db81f210a54ef9e2459a" -> null
-       storage_class          = "STANDARD" -> null
-       tags                   = {} -> null
-       tags_all               = {
-           "env"        = "staging"
-           "management" = "terraform"
-           "owner"      = "grants"
-           "repo"       = "cpf-reporter"
-           "service"    = "cpf-reporter"
-           "usage"      = "workload"
        } -> null
-       version_id             = ".o5R5PgRY8SLEUd1LsQRhfC4CHWJO16k" -> null
    }

  # aws_s3_object.origin_dist_artifact["static/js/UploadNewUploadPage.005e6f67.chunk.js.LICENSE.txt"] will be destroyed
  # (because key ["static/js/UploadNewUploadPage.005e6f67.chunk.js.LICENSE.txt"] is not in for_each map)
-   resource "aws_s3_object" "origin_dist_artifact" {
-       arn                    = "arn:aws:s3:::cpfreporter-origin-357150818708-us-west-2/dist/static/js/UploadNewUploadPage.005e6f67.chunk.js.LICENSE.txt" -> null
-       bucket                 = "cpfreporter-origin-357150818708-us-west-2" -> null
-       bucket_key_enabled     = false -> null
-       content_type           = "text/plain" -> null
-       etag                   = "cc27fa172211f2877b50629ac7228a71" -> null
-       force_destroy          = false -> null
-       id                     = "dist/static/js/UploadNewUploadPage.005e6f67.chunk.js.LICENSE.txt" -> null
-       key                    = "dist/static/js/UploadNewUploadPage.005e6f67.chunk.js.LICENSE.txt" -> null
-       metadata               = {} -> null
-       server_side_encryption = "AES256" -> null
-       source                 = "/home/runner/work/cpf-reporter/cpf-reporter/web/dist/static/js/UploadNewUploadPage.005e6f67.chunk.js.LICENSE.txt" -> null
-       source_hash            = "cc27fa172211f2877b50629ac7228a71" -> null
-       storage_class          = "STANDARD" -> null
-       tags                   = {} -> null
-       tags_all               = {
-           "env"        = "staging"
-           "management" = "terraform"
-           "owner"      = "grants"
-           "repo"       = "cpf-reporter"
-           "service"    = "cpf-reporter"
-           "usage"      = "workload"
        } -> null
-       version_id             = "Dt5pMV7zLbxjSIc7PdBV4ww4koZmizMx" -> null
    }

  # aws_s3_object.origin_dist_artifact["static/js/UploadNewUploadPage.c7b151e0.chunk.js"] will be created
+   resource "aws_s3_object" "origin_dist_artifact" {
+       acl                    = (known after apply)
+       arn                    = (known after apply)
+       bucket                 = "cpfreporter-origin-357150818708-us-west-2"
+       bucket_key_enabled     = (known after apply)
+       checksum_crc32         = (known after apply)
+       checksum_crc32c        = (known after apply)
+       checksum_sha1          = (known after apply)
+       checksum_sha256        = (known after apply)
+       content_type           = "text/javascript"
+       etag                   = "8768683c7466e3263c01ebc407a4a103"
+       force_destroy          = false
+       id                     = (known after apply)
+       key                    = "dist/static/js/UploadNewUploadPage.c7b151e0.chunk.js"
+       kms_key_id             = (known after apply)
+       server_side_encryption = "AES256"
+       source                 = "/home/runner/work/cpf-reporter/cpf-reporter/web/dist/static/js/UploadNewUploadPage.c7b151e0.chunk.js"
+       source_hash            = "8768683c7466e3263c01ebc407a4a103"
+       storage_class          = (known after apply)
+       tags_all               = {
+           "env"        = "staging"
+           "management" = "terraform"
+           "owner"      = "grants"
+           "repo"       = "cpf-reporter"
+           "service"    = "cpf-reporter"
+           "usage"      = "workload"
        }
+       version_id             = (known after apply)
    }

  # aws_s3_object.origin_dist_artifact["static/js/UploadNewUploadPage.c7b151e0.chunk.js.LICENSE.txt"] will be created
+   resource "aws_s3_object" "origin_dist_artifact" {
+       acl                    = (known after apply)
+       arn                    = (known after apply)
+       bucket                 = "cpfreporter-origin-357150818708-us-west-2"
+       bucket_key_enabled     = (known after apply)
+       checksum_crc32         = (known after apply)
+       checksum_crc32c        = (known after apply)
+       checksum_sha1          = (known after apply)
+       checksum_sha256        = (known after apply)
+       content_type           = "text/plain"
+       etag                   = "cc27fa172211f2877b50629ac7228a71"
+       force_destroy          = false
+       id                     = (known after apply)
+       key                    = "dist/static/js/UploadNewUploadPage.c7b151e0.chunk.js.LICENSE.txt"
+       kms_key_id             = (known after apply)
+       server_side_encryption = "AES256"
+       source                 = "/home/runner/work/cpf-reporter/cpf-reporter/web/dist/static/js/UploadNewUploadPage.c7b151e0.chunk.js.LICENSE.txt"
+       source_hash            = "cc27fa172211f2877b50629ac7228a71"
+       storage_class          = (known after apply)
+       tags_all               = {
+           "env"        = "staging"
+           "management" = "terraform"
+           "owner"      = "grants"
+           "repo"       = "cpf-reporter"
+           "service"    = "cpf-reporter"
+           "usage"      = "workload"
        }
+       version_id             = (known after apply)
    }

  # aws_s3_object.origin_dist_artifact["static/js/UploadUploadPage.47fd71b3.chunk.js"] will be created
+   resource "aws_s3_object" "origin_dist_artifact" {
+       acl                    = (known after apply)
+       arn                    = (known after apply)
+       bucket                 = "cpfreporter-origin-357150818708-us-west-2"
+       bucket_key_enabled     = (known after apply)
+       checksum_crc32         = (known after apply)
+       checksum_crc32c        = (known after apply)
+       checksum_sha1          = (known after apply)
+       checksum_sha256        = (known after apply)
+       content_type           = "text/javascript"
+       etag                   = "cc4dc53510f99d8567e4d1db42c9b887"
+       force_destroy          = false
+       id                     = (known after apply)
+       key                    = "dist/static/js/UploadUploadPage.47fd71b3.chunk.js"
+       kms_key_id             = (known after apply)
+       server_side_encryption = "AES256"
+       source                 = "/home/runner/work/cpf-reporter/cpf-reporter/web/dist/static/js/UploadUploadPage.47fd71b3.chunk.js"
+       source_hash            = "cc4dc53510f99d8567e4d1db42c9b887"
+       storage_class          = (known after apply)
+       tags_all               = {
+           "env"        = "staging"
+           "management" = "terraform"
+           "owner"      = "grants"
+           "repo"       = "cpf-reporter"
+           "service"    = "cpf-reporter"
+           "usage"      = "workload"
        }
+       version_id             = (known after apply)
    }

  # aws_s3_object.origin_dist_artifact["static/js/UploadUploadPage.47fd71b3.chunk.js.LICENSE.txt"] will be created
+   resource "aws_s3_object" "origin_dist_artifact" {
+       acl                    = (known after apply)
+       arn                    = (known after apply)
+       bucket                 = "cpfreporter-origin-357150818708-us-west-2"
+       bucket_key_enabled     = (known after apply)
+       checksum_crc32         = (known after apply)
+       checksum_crc32c        = (known after apply)
+       checksum_sha1          = (known after apply)
+       checksum_sha256        = (known after apply)
+       content_type           = "text/plain"
+       etag                   = "efea1edc51440599026956ce53a048e0"
+       force_destroy          = false
+       id                     = (known after apply)
+       key                    = "dist/static/js/UploadUploadPage.47fd71b3.chunk.js.LICENSE.txt"
+       kms_key_id             = (known after apply)
+       server_side_encryption = "AES256"
+       source                 = "/home/runner/work/cpf-reporter/cpf-reporter/web/dist/static/js/UploadUploadPage.47fd71b3.chunk.js.LICENSE.txt"
+       source_hash            = "efea1edc51440599026956ce53a048e0"
+       storage_class          = (known after apply)
+       tags_all               = {
+           "env"        = "staging"
+           "management" = "terraform"
+           "owner"      = "grants"
+           "repo"       = "cpf-reporter"
+           "service"    = "cpf-reporter"
+           "usage"      = "workload"
        }
+       version_id             = (known after apply)
    }

  # aws_s3_object.origin_dist_artifact["static/js/UploadUploadPage.52c70fce.chunk.js"] will be destroyed
  # (because key ["static/js/UploadUploadPage.52c70fce.chunk.js"] is not in for_each map)
-   resource "aws_s3_object" "origin_dist_artifact" {
-       arn                    = "arn:aws:s3:::cpfreporter-origin-357150818708-us-west-2/dist/static/js/UploadUploadPage.52c70fce.chunk.js" -> null
-       bucket                 = "cpfreporter-origin-357150818708-us-west-2" -> null
-       bucket_key_enabled     = false -> null
-       content_type           = "text/javascript" -> null
-       etag                   = "69db072111a155eed03f9752dc4c80b4" -> null
-       force_destroy          = false -> null
-       id                     = "dist/static/js/UploadUploadPage.52c70fce.chunk.js" -> null
-       key                    = "dist/static/js/UploadUploadPage.52c70fce.chunk.js" -> null
-       metadata               = {} -> null
-       server_side_encryption = "AES256" -> null
-       source                 = "/home/runner/work/cpf-reporter/cpf-reporter/web/dist/static/js/UploadUploadPage.52c70fce.chunk.js" -> null
-       source_hash            = "69db072111a155eed03f9752dc4c80b4" -> null
-       storage_class          = "STANDARD" -> null
-       tags                   = {} -> null
-       tags_all               = {
-           "env"        = "staging"
-           "management" = "terraform"
-           "owner"      = "grants"
-           "repo"       = "cpf-reporter"
-           "service"    = "cpf-reporter"
-           "usage"      = "workload"
        } -> null
-       version_id             = "hsKUdVRgPlOJdRHq9AFK8G18rDvLvHhq" -> null
    }

  # aws_s3_object.origin_dist_artifact["static/js/UploadUploadPage.52c70fce.chunk.js.LICENSE.txt"] will be destroyed
  # (because key ["static/js/UploadUploadPage.52c70fce.chunk.js.LICENSE.txt"] is not in for_each map)
-   resource "aws_s3_object" "origin_dist_artifact" {
-       arn                    = "arn:aws:s3:::cpfreporter-origin-357150818708-us-west-2/dist/static/js/UploadUploadPage.52c70fce.chunk.js.LICENSE.txt" -> null
-       bucket                 = "cpfreporter-origin-357150818708-us-west-2" -> null
-       bucket_key_enabled     = false -> null
-       content_type           = "text/plain" -> null
-       etag                   = "efea1edc51440599026956ce53a048e0" -> null
-       force_destroy          = false -> null
-       id                     = "dist/static/js/UploadUploadPage.52c70fce.chunk.js.LICENSE.txt" -> null
-       key                    = "dist/static/js/UploadUploadPage.52c70fce.chunk.js.LICENSE.txt" -> null
-       metadata               = {} -> null
-       server_side_encryption = "AES256" -> null
-       source                 = "/home/runner/work/cpf-reporter/cpf-reporter/web/dist/static/js/UploadUploadPage.52c70fce.chunk.js.LICENSE.txt" -> null
-       source_hash            = "efea1edc51440599026956ce53a048e0" -> null
-       storage_class          = "STANDARD" -> null
-       tags                   = {} -> null
-       tags_all               = {
-           "env"        = "staging"
-           "management" = "terraform"
-           "owner"      = "grants"
-           "repo"       = "cpf-reporter"
-           "service"    = "cpf-reporter"
-           "usage"      = "workload"
        } -> null
-       version_id             = "Z3NGNwyot3HFVoSXlzJLQgNu8JpC3rQh" -> null
    }

  # aws_s3_object.origin_dist_artifact["static/js/UploadUploadsPage.bf515f61.chunk.js"] will be destroyed
  # (because key ["static/js/UploadUploadsPage.bf515f61.chunk.js"] is not in for_each map)
-   resource "aws_s3_object" "origin_dist_artifact" {
-       arn                    = "arn:aws:s3:::cpfreporter-origin-357150818708-us-west-2/dist/static/js/UploadUploadsPage.bf515f61.chunk.js" -> null
-       bucket                 = "cpfreporter-origin-357150818708-us-west-2" -> null
-       bucket_key_enabled     = false -> null
-       content_type           = "text/javascript" -> null
-       etag                   = "6c0d5b617943607e6a0e25aa9746c105" -> null
-       force_destroy          = false -> null
-       id                     = "dist/static/js/UploadUploadsPage.bf515f61.chunk.js" -> null
-       key                    = "dist/static/js/UploadUploadsPage.bf515f61.chunk.js" -> null
-       metadata               = {} -> null
-       server_side_encryption = "AES256" -> null
-       source                 = "/home/runner/work/cpf-reporter/cpf-reporter/web/dist/static/js/UploadUploadsPage.bf515f61.chunk.js" -> null
-       source_hash            = "6c0d5b617943607e6a0e25aa9746c105" -> null
-       storage_class          = "STANDARD" -> null
-       tags                   = {} -> null
-       tags_all               = {
-           "env"        = "staging"
-           "management" = "terraform"
-           "owner"      = "grants"
-           "repo"       = "cpf-reporter"
-           "service"    = "cpf-reporter"
-           "usage"      = "workload"
        } -> null
-       version_id             = "93D0IvrKyfC7NV3Z8DprPblmcqApayGT" -> null
    }

  # aws_s3_object.origin_dist_artifact["static/js/UploadUploadsPage.bf515f61.chunk.js.LICENSE.txt"] will be destroyed
  # (because key ["static/js/UploadUploadsPage.bf515f61.chunk.js.LICENSE.txt"] is not in for_each map)
-   resource "aws_s3_object" "origin_dist_artifact" {
-       arn                    = "arn:aws:s3:::cpfreporter-origin-357150818708-us-west-2/dist/static/js/UploadUploadsPage.bf515f61.chunk.js.LICENSE.txt" -> null
-       bucket                 = "cpfreporter-origin-357150818708-us-west-2" -> null
-       bucket_key_enabled     = false -> null
-       content_type           = "text/plain" -> null
-       etag                   = "43ff778014632a7ef9766fd4374290b4" -> null
-       force_destroy          = false -> null
-       id                     = "dist/static/js/UploadUploadsPage.bf515f61.chunk.js.LICENSE.txt" -> null
-       key                    = "dist/static/js/UploadUploadsPage.bf515f61.chunk.js.LICENSE.txt" -> null
-       metadata               = {} -> null
-       server_side_encryption = "AES256" -> null
-       source                 = "/home/runner/work/cpf-reporter/cpf-reporter/web/dist/static/js/UploadUploadsPage.bf515f61.chunk.js.LICENSE.txt" -> null
-       source_hash            = "43ff778014632a7ef9766fd4374290b4" -> null
-       storage_class          = "STANDARD" -> null
-       tags                   = {} -> null
-       tags_all               = {
-           "env"        = "staging"
-           "management" = "terraform"
-           "owner"      = "grants"
-           "repo"       = "cpf-reporter"
-           "service"    = "cpf-reporter"
-           "usage"      = "workload"
        } -> null
-       version_id             = "HJtthqFSaaOmkYTwatom5iB7t0f6DbCp" -> null
    }

  # aws_s3_object.origin_dist_artifact["static/js/UploadUploadsPage.d006aac9.chunk.js"] will be created
+   resource "aws_s3_object" "origin_dist_artifact" {
+       acl                    = (known after apply)
+       arn                    = (known after apply)
+       bucket                 = "cpfreporter-origin-357150818708-us-west-2"
+       bucket_key_enabled     = (known after apply)
+       checksum_crc32         = (known after apply)
+       checksum_crc32c        = (known after apply)
+       checksum_sha1          = (known after apply)
+       checksum_sha256        = (known after apply)
+       content_type           = "text/javascript"
+       etag                   = "ef1d00af6ff4704916f223a344b437d6"
+       force_destroy          = false
+       id                     = (known after apply)
+       key                    = "dist/static/js/UploadUploadsPage.d006aac9.chunk.js"
+       kms_key_id             = (known after apply)
+       server_side_encryption = "AES256"
+       source                 = "/home/runner/work/cpf-reporter/cpf-reporter/web/dist/static/js/UploadUploadsPage.d006aac9.chunk.js"
+       source_hash            = "ef1d00af6ff4704916f223a344b437d6"
+       storage_class          = (known after apply)
+       tags_all               = {
+           "env"        = "staging"
+           "management" = "terraform"
+           "owner"      = "grants"
+           "repo"       = "cpf-reporter"
+           "service"    = "cpf-reporter"
+           "usage"      = "workload"
        }
+       version_id             = (known after apply)
    }

  # aws_s3_object.origin_dist_artifact["static/js/UploadUploadsPage.d006aac9.chunk.js.LICENSE.txt"] will be created
+   resource "aws_s3_object" "origin_dist_artifact" {
+       acl                    = (known after apply)
+       arn                    = (known after apply)
+       bucket                 = "cpfreporter-origin-357150818708-us-west-2"
+       bucket_key_enabled     = (known after apply)
+       checksum_crc32         = (known after apply)
+       checksum_crc32c        = (known after apply)
+       checksum_sha1          = (known after apply)
+       checksum_sha256        = (known after apply)
+       content_type           = "text/plain"
+       etag                   = "43ff778014632a7ef9766fd4374290b4"
+       force_destroy          = false
+       id                     = (known after apply)
+       key                    = "dist/static/js/UploadUploadsPage.d006aac9.chunk.js.LICENSE.txt"
+       kms_key_id             = (known after apply)
+       server_side_encryption = "AES256"
+       source                 = "/home/runner/work/cpf-reporter/cpf-reporter/web/dist/static/js/UploadUploadsPage.d006aac9.chunk.js.LICENSE.txt"
+       source_hash            = "43ff778014632a7ef9766fd4374290b4"
+       storage_class          = (known after apply)
+       tags_all               = {
+           "env"        = "staging"
+           "management" = "terraform"
+           "owner"      = "grants"
+           "repo"       = "cpf-reporter"
+           "service"    = "cpf-reporter"
+           "usage"      = "workload"
        }
+       version_id             = (known after apply)
    }

  # aws_s3_object.origin_dist_artifact["static/js/UserEditUserPage.3ee6a801.chunk.js"] will be destroyed
  # (because key ["static/js/UserEditUserPage.3ee6a801.chunk.js"] is not in for_each map)
-   resource "aws_s3_object" "origin_dist_artifact" {
-       arn                    = "arn:aws:s3:::cpfreporter-origin-357150818708-us-west-2/dist/static/js/UserEditUserPage.3ee6a801.chunk.js" -> null
-       bucket                 = "cpfreporter-origin-357150818708-us-west-2" -> null
-       bucket_key_enabled     = false -> null
-       content_type           = "text/javascript" -> null
-       etag                   = "4c02fe3c93ce28cdec2488e3cfbbb40b" -> null
-       force_destroy          = false -> null
-       id                     = "dist/static/js/UserEditUserPage.3ee6a801.chunk.js" -> null
-       key                    = "dist/static/js/UserEditUserPage.3ee6a801.chunk.js" -> null
-       metadata               = {} -> null
-       server_side_encryption = "AES256" -> null
-       source                 = "/home/runner/work/cpf-reporter/cpf-reporter/web/dist/static/js/UserEditUserPage.3ee6a801.chunk.js" -> null
-       source_hash            = "4c02fe3c93ce28cdec2488e3cfbbb40b" -> null
-       storage_class          = "STANDARD" -> null
-       tags                   = {} -> null
-       tags_all               = {
-           "env"        = "staging"
-           "management" = "terraform"
-           "owner"      = "grants"
-           "repo"       = "cpf-reporter"
-           "service"    = "cpf-reporter"
-           "usage"      = "workload"
        } -> null
-       version_id             = "T.DkLY_rW48f.qm5ipLkZbRaG7Yhbw1V" -> null
    }

  # aws_s3_object.origin_dist_artifact["static/js/UserEditUserPage.3ee6a801.chunk.js.LICENSE.txt"] will be destroyed
  # (because key ["static/js/UserEditUserPage.3ee6a801.chunk.js.LICENSE.txt"] is not in for_each map)
-   resource "aws_s3_object" "origin_dist_artifact" {
-       arn                    = "arn:aws:s3:::cpfreporter-origin-357150818708-us-west-2/dist/static/js/UserEditUserPage.3ee6a801.chunk.js.LICENSE.txt" -> null
-       bucket                 = "cpfreporter-origin-357150818708-us-west-2" -> null
-       bucket_key_enabled     = false -> null
-       content_type           = "text/plain" -> null
-       etag                   = "63401d07fb99a2c1ff4404567f6b3ec5" -> null
-       force_destroy          = false -> null
-       id                     = "dist/static/js/UserEditUserPage.3ee6a801.chunk.js.LICENSE.txt" -> null
-       key                    = "dist/static/js/UserEditUserPage.3ee6a801.chunk.js.LICENSE.txt" -> null
-       metadata               = {} -> null
-       server_side_encryption = "AES256" -> null
-       source                 = "/home/runner/work/cpf-reporter/cpf-reporter/web/dist/static/js/UserEditUserPage.3ee6a801.chunk.js.LICENSE.txt" -> null
-       source_hash            = "63401d07fb99a2c1ff4404567f6b3ec5" -> null
-       storage_class          = "STANDARD" -> null
-       tags                   = {} -> null
-       tags_all               = {
-           "env"        = "staging"
-           "management" = "terraform"
-           "owner"      = "grants"
-           "repo"       = "cpf-reporter"
-           "service"    = "cpf-reporter"
-           "usage"      = "workload"
        } -> null
-       version_id             = "L1ye97gBjXny1F3kGQVonYIoSk4P2.PW" -> null
    }

  # aws_s3_object.origin_dist_artifact["static/js/UserEditUserPage.4a273c54.chunk.js"] will be created
+   resource "aws_s3_object" "origin_dist_artifact" {
+       acl                    = (known after apply)
+       arn                    = (known after apply)
+       bucket                 = "cpfreporter-origin-357150818708-us-west-2"
+       bucket_key_enabled     = (known after apply)
+       checksum_crc32         = (known after apply)
+       checksum_crc32c        = (known after apply)
+       checksum_sha1          = (known after apply)
+       checksum_sha256        = (known after apply)
+       content_type           = "text/javascript"
+       etag                   = "b8858b33797b714bd3b059ea30a62a6a"
+       force_destroy          = false
+       id                     = (known after apply)
+       key                    = "dist/static/js/UserEditUserPage.4a273c54.chunk.js"
+       kms_key_id             = (known after apply)
+       server_side_encryption = "AES256"
+       source                 = "/home/runner/work/cpf-reporter/cpf-reporter/web/dist/static/js/UserEditUserPage.4a273c54.chunk.js"
+       source_hash            = "b8858b33797b714bd3b059ea30a62a6a"
+       storage_class          = (known after apply)
+       tags_all               = {
+           "env"        = "staging"
+           "management" = "terraform"
+           "owner"      = "grants"
+           "repo"       = "cpf-reporter"
+           "service"    = "cpf-reporter"
+           "usage"      = "workload"
        }
+       version_id             = (known after apply)
    }

  # aws_s3_object.origin_dist_artifact["static/js/UserEditUserPage.4a273c54.chunk.js.LICENSE.txt"] will be created
+   resource "aws_s3_object" "origin_dist_artifact" {
+       acl                    = (known after apply)
+       arn                    = (known after apply)
+       bucket                 = "cpfreporter-origin-357150818708-us-west-2"
+       bucket_key_enabled     = (known after apply)
+       checksum_crc32         = (known after apply)
+       checksum_crc32c        = (known after apply)
+       checksum_sha1          = (known after apply)
+       checksum_sha256        = (known after apply)
+       content_type           = "text/plain"
+       etag                   = "63401d07fb99a2c1ff4404567f6b3ec5"
+       force_destroy          = false
+       id                     = (known after apply)
+       key                    = "dist/static/js/UserEditUserPage.4a273c54.chunk.js.LICENSE.txt"
+       kms_key_id             = (known after apply)
+       server_side_encryption = "AES256"
+       source                 = "/home/runner/work/cpf-reporter/cpf-reporter/web/dist/static/js/UserEditUserPage.4a273c54.chunk.js.LICENSE.txt"
+       source_hash            = "63401d07fb99a2c1ff4404567f6b3ec5"
+       storage_class          = (known after apply)
+       tags_all               = {
+           "env"        = "staging"
+           "management" = "terraform"
+           "owner"      = "grants"
+           "repo"       = "cpf-reporter"
+           "service"    = "cpf-reporter"
+           "usage"      = "workload"
        }
+       version_id             = (known after apply)
    }

  # aws_s3_object.origin_dist_artifact["static/js/UserNewUserPage.3246735d.chunk.js"] will be created
+   resource "aws_s3_object" "origin_dist_artifact" {
+       acl                    = (known after apply)
+       arn                    = (known after apply)
+       bucket                 = "cpfreporter-origin-357150818708-us-west-2"
+       bucket_key_enabled     = (known after apply)
+       checksum_crc32         = (known after apply)
+       checksum_crc32c        = (known after apply)
+       checksum_sha1          = (known after apply)
+       checksum_sha256        = (known after apply)
+       content_type           = "text/javascript"
+       etag                   = "f17a57d1c1c61869ba558c559143a177"
+       force_destroy          = false
+       id                     = (known after apply)
+       key                    = "dist/static/js/UserNewUserPage.3246735d.chunk.js"
+       kms_key_id             = (known after apply)
+       server_side_encryption = "AES256"
+       source                 = "/home/runner/work/cpf-reporter/cpf-reporter/web/dist/static/js/UserNewUserPage.3246735d.chunk.js"
+       source_hash            = "f17a57d1c1c61869ba558c559143a177"
+       storage_class          = (known after apply)
+       tags_all               = {
+           "env"        = "staging"
+           "management" = "terraform"
+           "owner"      = "grants"
+           "repo"       = "cpf-reporter"
+           "service"    = "cpf-reporter"
+           "usage"      = "workload"
        }
+       version_id             = (known after apply)
    }

  # aws_s3_object.origin_dist_artifact["static/js/UserNewUserPage.3246735d.chunk.js.LICENSE.txt"] will be created
+   resource "aws_s3_object" "origin_dist_artifact" {
+       acl                    = (known after apply)
+       arn                    = (known after apply)
+       bucket                 = "cpfreporter-origin-357150818708-us-west-2"
+       bucket_key_enabled     = (known after apply)
+       checksum_crc32         = (known after apply)
+       checksum_crc32c        = (known after apply)
+       checksum_sha1          = (known after apply)
+       checksum_sha256        = (known after apply)
+       content_type           = "text/plain"
+       etag                   = "8323bdf2524d967917b1d59b40ac09ac"
+       force_destroy          = false
+       id                     = (known after apply)
+       key                    = "dist/static/js/UserNewUserPage.3246735d.chunk.js.LICENSE.txt"
+       kms_key_id             = (known after apply)
+       server_side_encryption = "AES256"
+       source                 = "/home/runner/work/cpf-reporter/cpf-reporter/web/dist/static/js/UserNewUserPage.3246735d.chunk.js.LICENSE.txt"
+       source_hash            = "8323bdf2524d967917b1d59b40ac09ac"
+       storage_class          = (known after apply)
+       tags_all               = {
+           "env"        = "staging"
+           "management" = "terraform"
+           "owner"      = "grants"
+           "repo"       = "cpf-reporter"
+           "service"    = "cpf-reporter"
+           "usage"      = "workload"
        }
+       version_id             = (known after apply)
    }

  # aws_s3_object.origin_dist_artifact["static/js/UserNewUserPage.8429bba4.chunk.js"] will be destroyed
  # (because key ["static/js/UserNewUserPage.8429bba4.chunk.js"] is not in for_each map)
-   resource "aws_s3_object" "origin_dist_artifact" {
-       arn                    = "arn:aws:s3:::cpfreporter-origin-357150818708-us-west-2/dist/static/js/UserNewUserPage.8429bba4.chunk.js" -> null
-       bucket                 = "cpfreporter-origin-357150818708-us-west-2" -> null
-       bucket_key_enabled     = false -> nu...*[Comment body truncated]*